app/views/tasks/index.html.haml

SELECT "tasks".* FROM "tasks" INNER JOIN "participants" ON "participants"."task_id" = "tasks"."id" INNER JOIN "users" ON "users"."id" = "participants"."user_id" WHERE (owner_id = 2 OR participants.user_id = 2) GROUP BY "tasks"."id"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 1], ["id", 3], ["id", 2]]
---
							.task-participants
								- task.participating_users.includes(:user).each do |participant|
									.task-participant{ class: "task-participant--#{participant.role}" }