app/views/tasks/show.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 1], ["id", 3], ["id", 2]]
---
          .font-weight-bold.text-uppercase= 'Participantes'
        - @task.participating_users.includes(:user).each do |participant|
          .task-participant{ class: "task-participant--#{participant.role}" }

SELECT "notes".* FROM "notes" WHERE "notes"."task_id" = $1  [["task_id", 1]]
SELECT 1 AS one FROM "notes" WHERE "notes"."task_id" = $1 LIMIT $2  [["task_id", 1], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."task_id" = $1 ORDER BY "notes"."created_at" ASC  [["task_id", 1]]
---
      .card-body
        - if @task.notes.exists?
          .notes
            - @task.notes.order(created_at: :asc).each do |note|
              .note-element