app/controllers/tasks/notes_controller.rb

  def create
    @note = @task.notes.new(notes_params)
    @note.user = current_user
    @note.save
---
INSERT INTO "notes" ("body", "user_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "nota 1"], ["user_id", 8], ["task_id", 1], ["created_at", "2021-09-01 14:17:11.786860"], ["updated_at", "2021-09-01 14:17:11.786860"]]

  def set_task
    @task = Task.find(params[:task_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]