app/controllers/tasks_controller.rb

  def index
    @tasks = Task.joins(:participants).where(
      'owner_id = ? OR participants.user_id = ?',
      current_user.id,
      current_user.id
    ).group(:id)
---
SELECT "tasks".* FROM "tasks" INNER JOIN "participants" ON "participants"."task_id" = "tasks"."id" INNER JOIN "users" ON "users"."id" = "participants"."user_id" WHERE (owner_id = 2 OR participants.user_id = 2) GROUP BY "tasks"."id"

  def create
    @task = Task.new(task_params)
    @task.owner = current_user
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "description", "due_date", "category_id", "created_at", "updated_at", "owner_id", "code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"